posts/2015-06-21-the-vanity-of-our-hope.org

#+date: <2015-06-21>
#+filetags: prayer religion
#+title: The Vanity of Our Hope


A reflection on the lives lost this week in Charleston, and the responsibility that we bear, either explicitly or implicitly:

God of justice,

We are told that heaven rejoices\\
over what has been found,\\
does heaven also weep for\\
what has been lost?\\
\\
For the one whose heart\\
was lost in hatred,\\
and whose mind was\\
filled with empty lies?\\
\\
For the nine lives that\\
were taken in an act\\
of unspeakable horror?\\
\\
Does heaven also mourn\\
at the loss of our hope,\\
or does heaven simply sigh,\\
for that hope was\\
always vain and self-serving?\\
\\
For we hoped that\\
things would get better\\
as time passed,\\
with no effort, and no cost,\\
\\
We hoped to measure our lives\\
by the things that we have,\\
and not by the people that we ignore,\\
\\
We hoped that it would\\
be enough to just not hate,\\
even if we could not really love.\\
\\
Forgive us, Lord,\\
for the sin of settling for\\
something less than than\\
the full Kingdom of God,\\
\\
But even more for the\\
greater sin of never\\
really wanting it at all.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
