docs/posts/2015-06-21-the-vanity-of-our-hope.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Vanity of Our Hope</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Vanity of Our Hope</h1>
<p class="subtitle" role="doc-subtitle">Jun 21, 2015</p>
</header><p>
A reflection on the lives lost this week in Charleston, and the responsibility that we bear, either explicitly or implicitly:
</p>

<p>
God of justice,
</p>

<p>
We are told that heaven rejoices<br>
over what has been found,<br>
does heaven also weep for<br>
what has been lost?<br>
<br>
For the one whose heart<br>
was lost in hatred,<br>
and whose mind was<br>
filled with empty lies?<br>
<br>
For the nine lives that<br>
were taken in an act<br>
of unspeakable horror?<br>
<br>
Does heaven also mourn<br>
at the loss of our hope,<br>
or does heaven simply sigh,<br>
for that hope was<br>
always vain and self-serving?<br>
<br>
For we hoped that<br>
things would get better<br>
as time passed,<br>
with no effort, and no cost,<br>
<br>
We hoped to measure our lives<br>
by the things that we have,<br>
and not by the people that we ignore,<br>
<br>
We hoped that it would<br>
be enough to just not hate,<br>
even if we could not really love.<br>
<br>
Forgive us, Lord,<br>
for the sin of settling for<br>
something less than than<br>
the full Kingdom of God,<br>
<br>
But even more for the<br>
greater sin of never<br>
really wanting it at all.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org926579a">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
